tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationWeb.cpp
        for (const WateringPlan& plan : config->plans) {
            if (!plan.configured && static_cast<int>(plan.id - 1U) != firstAvailable) continue;
            Esp32BaseWeb::sendChunk("<dialog id='plan-"); sendUnsigned(plan.id);
            Esp32BaseWeb::sendChunk("' class='panel eb-modal plan-modal' data-eb-light-dismiss='1'><h2>");
            Esp32BaseWeb::writeHtmlEscaped(plan.configured ? "编辑浇水计划" : "新增浇水计划");
            Esp32BaseWeb::sendChunk("</h2><form method='post' action='/irrigation/plans' onsubmit='return once(this)'><input type='hidden' name='action' value='save'><input type='hidden' name='plan_id' value='"); sendUnsigned(plan.id);
            Esp32BaseWeb::sendChunk("'><input type='hidden' name='revision' value='"); sendUnsigned(config->revision);
            Esp32BaseWeb::sendChunk("'><div class='plan-editor'><section class='plan-group'><h3>基本信息</h3><small>计划名称用于运行和浇水记录；自动执行关闭后仍可手动启动。</small><div class='plan-basic'><p class='field'><label>计划名称</label><input type='text' name='name' maxlength='63' required value='");
            Esp32BaseWeb::writeHtmlEscaped(plan.name.data());
            Esp32BaseWeb::sendChunk("'></p><div class='plan-switch'><label><input type='checkbox' name='schedule_enabled' value='1' ");
            if (plan.scheduleEnabled) Esp32BaseWeb::sendChunk("checked");
            Esp32BaseWeb::sendChunk("> 自动执行</label><small>仅控制定时执行；关闭后仍可在首页作为手动浇水模板。</small></div></div></section><section class='plan-group'><h3>自动执行时间</h3><small>每天最多执行 4 次；留空表示不使用。点击“清除”可删除已经设置的时间。</small><div class='plan-times'>");
            for (uint8_t index = 0; index < plan.startMinutes.size(); ++index) {
                Esp32BaseWeb::sendChunk("<div class='plan-time'><label>启动时间 "); sendUnsigned(index + 1U);
                Esp32BaseWeb::sendChunk("</label><div class='plan-time-row'><input type='time' name='time"); sendUnsigned(index + 1U); Esp32BaseWeb::sendChunk("' value='");
                if (plan.startMinutes[index] != kUnusedStartMinute) { char time[8]; std::snprintf(time, sizeof(time), "%02u:%02u", plan.startMinutes[index] / 60U, plan.startMinutes[index] % 60U); Esp32BaseWeb::sendChunk(time); }
                Esp32BaseWeb::sendChunk("'><button type='button' class='secondary clear-time' onclick=\"this.previousElementSibling.value=''\">清除</button></div></div>");
            }
            Esp32BaseWeb::sendChunk("</div></section><section class='plan-group'><h3>各水路浇水时长</h3><small>这里只显示已启用水路；设置为 0 分钟表示本计划不浇该水路。</small><div class='plan-zones'>");
            for (uint8_t index = 0; index < plan.zoneDurationMinutes.size(); ++index) {
                if (!config->zones[index].enabled) continue;
                Esp32BaseWeb::sendChunk("<p class='plan-zone'><label>"); Esp32BaseWeb::writeHtmlEscaped(config->zones[index].name.data());
                Esp32BaseWeb::sendChunk("</label><input type='number' name='zone"); sendUnsigned(index + 1U);
                Esp32BaseWeb::sendChunk("' min='0' max='"); sendUnsigned(config->runLimits.maximumZoneDurationMinutes); Esp32BaseWeb::sendChunk("' value='"); sendUnsigned(plan.zoneDurationMinutes[index]);
                Esp32BaseWeb::sendChunk("'><small>单位：分钟，范围 0～"); sendUnsigned(config->runLimits.maximumZoneDurationMinutes); Esp32BaseWeb::sendChunk("。</small></p>");
            }
            Esp32BaseWeb::sendChunk("</div></section></div><div class='actions plan-form-actions'><button type='button' class='secondary' onclick='this.closest(\"dialog\").close()'>取消</button><input type='submit' value='保存计划'></div></form>");
            if (plan.configured) { Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/plans' onsubmit=\"return confirm('确认删除该计划？')&&once(this)\"><input type='hidden' name='action' value='delete'><input type='hidden' name='plan_id' value='"); sendUnsigned(plan.id); Esp32BaseWeb::sendChunk("'><input type='hidden' name='revision' value='"); sendUnsigned(config->revision); Esp32BaseWeb::sendChunk("'><div class='actions'><input class='danger' type='submit' value='删除计划'></div></form>"); }
            Esp32BaseWeb::sendChunk("</dialog>");
        }
    }
    endPage();
}

void IrrigationWeb::zones() {
    if (Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        if (!Esp32BaseWeb::checkPostAllowed("irrigation_zone_save")) return;
        bool success = false;
        if (actionIs("save")) {
            success = saveZoneFromRequest();
        } else if (actionIs("start_single_output")) {
            const IrrigationConfig* config = g_app->configuration();
            uint32_t zoneId = 0;
            char mode[12]{};
            if (config &&
                uintParam("zone_id", 1, BoardPins::kZoneCount, zoneId) &&
                getParam("target_mode", mode, sizeof(mode))) {
                uint32_t targetDurationSec = 0;
                uint32_t targetWaterMl = 0;
                if (std::strcmp(mode, "time") == 0) {
                    uintParam(
                        "duration_seconds",
                        1,
                        static_cast<uint32_t>(
                            config->runLimits.maximumZoneDurationMinutes) *
                            60U,
                        targetDurationSec);
                } else if (std::strcmp(mode, "volume") == 0) {
                    char liters[24]{};
                    if (getParam("target_liters", liters, sizeof(liters)) &&
                        IrrigationConfigRules::parseWaterVolumeLiters(
                            liters, targetWaterMl) &&
                        targetWaterMl % 100U == 0 &&
                        targetWaterMl <=
                            static_cast<uint32_t>(config->runLimits.maximumSingleOutputLiters) * 1000U) {
                        targetDurationSec =
                            static_cast<uint32_t>(config->runLimits.maximumZoneDurationMinutes) * 60U;
                    } else {
                        targetWaterMl = 0;
                    }
                }
                success = targetDurationSec != 0 &&
                          g_app->startSingleOutput(static_cast<uint8_t>(zoneId),
                                                   targetDurationSec,
                                                   targetWaterMl) ==
                              WateringStartResult::Started;
            }
        } else if (actionIs("stop_single_output")) {
            const WateringStatus status = g_app->wateringStatus();
            success = status.active &&
                      status.source == WateringSource::SingleOutput &&
                      status.purpose == WateringPurpose::Normal &&
                      g_app->stopWatering();
        }
        redirectResult("/irrigation/zones", success);
        return;
    }
    if (!beginPage("水路设置", "启用实际安装的水路，并学习各水路的基准流量")) return;
    Esp32BaseWeb::sendChunk(
        "<style>"
        ".zone-meter{display:flex;align-items:center;justify-content:space-between;gap:16px}"
        ".zone-meter-main{display:flex;align-items:baseline;flex-wrap:wrap;gap:8px}"
        ".zone-meter-label{margin:0;color:var(--eb-muted);font-size:13px}"
        ".zone-meter-value{display:flex;align-items:baseline;gap:6px;color:var(--eb-primary);line-height:1}"
        ".zone-meter-number{font-size:18px;font-weight:650}"
        ".zone-meter-unit{font-size:14px;color:var(--eb-muted)}"
        ".zone-table th{font-weight:600}.zone-table td{font-weight:400}"
        ".zone-table .tag{font-weight:500}"
        ".zone-table .btnlink{font-weight:500}"
        ".single-output-intro{margin:0 0 18px;color:var(--eb-muted);font-size:13px;line-height:1.6}"
        ".single-output-step{margin:0 0 20px}.single-output-step-title{display:flex;align-items:center;gap:8px;margin:0 0 9px;font-size:13px;font-weight:650}.single-output-step-title span{display:flex;align-items:center;justify-content:center;width:22px;height:22px;border-radius:50%;background:var(--eb-primary-soft);color:var(--eb-primary);font-size:12px}"
        ".single-output-zones{display:grid;grid-template-columns:repeat(auto-fit,minmax(140px,1fr));gap:8px}"
        ".single-output-option{position:relative;display:block;margin:0}.single-output-option>input{position:absolute;width:1px;height:1px;opacity:0}"
        ".single-output-zone-card{position:relative;display:block;height:100%;min-height:68px;padding:11px 34px 11px 12px;border:1px solid var(--eb-line);border-radius:9px;background:#fff;cursor:pointer;transition:border-color .15s,background .15s,box-shadow .15s}"
        ".single-output-zone-card b,.single-output-zone-card small{display:block}.single-output-zone-card b{font-weight:550}.single-output-zone-card small{margin-top:3px;color:var(--eb-muted);font-size:11px;line-height:1.45}.single-output-zone-check{position:absolute;right:11px;top:11px;display:flex;align-items:center;justify-content:center;width:18px;height:18px;border:1px solid var(--eb-line);border-radius:50%;color:transparent;font-size:12px}"
        ".single-output-option>input:checked+.single-output-zone-card{border-color:var(--eb-primary);background:var(--eb-primary-soft);box-shadow:0 0 0 1px var(--eb-primary)}.single-output-option>input:checked+.single-output-zone-card .single-output-zone-check{border-color:var(--eb-primary);background:var(--eb-primary);color:#fff}.single-output-option>input:focus-visible+span{outline:2px solid var(--eb-primary);outline-offset:2px}"
        ".single-output-workspace{display:grid;grid-template-columns:minmax(260px,360px) minmax(320px,560px);gap:18px;align-items:start}.single-output-mode-group{min-width:0;margin:0;padding:0;border:0}.single-output-mode-group legend{margin:0 0 9px;padding:0;font-size:13px;font-weight:650}.single-output-modes{display:grid;grid-template-columns:repeat(2,minmax(0,1fr));gap:4px;padding:4px;border-radius:10px;background:var(--eb-soft)}"
        ".single-output-mode-card{display:block;padding:10px 12px;border:1px solid transparent;border-radius:7px;color:var(--eb-muted);text-align:center;cursor:pointer}.single-output-mode-card b{display:block;font-size:13px;font-weight:550}.single-output-mode-card small{display:block;margin-top:2px;font-size:10px}.single-output-option>input:checked+.single-output-mode-card{border-color:var(--eb-line);background:#fff;color:var(--eb-primary);box-shadow:0 1px 2px rgba(16,24,40,.06)}"
        ".single-output-editor{min-width:0;padding:15px 16px;border:1px solid var(--eb-line-soft);border-radius:10px;background:var(--eb-soft)}.single-output-target[hidden]{display:none!important}.single-output-target-label{display:block;margin-bottom:7px;font-size:12px;font-weight:600}.single-output-value-row{display:grid;grid-template-columns:42px minmax(150px,230px) 42px;gap:7px;align-items:center}.single-output-stepper{width:42px;min-width:42px;height:42px;min-height:42px;padding:0;border-color:var(--eb-button-border);background:#fff;color:var(--eb-primary);font-size:20px;line-height:1}.single-output-stepper:hover{background:var(--eb-primary-soft);color:var(--eb-primary)}.single-output-value{position:relative}.single-output-value input{width:100%;max-width:none;height:42px;margin:0;padding:8px 44px 8px 12px;background:#fff;font-size:18px;font-variant-numeric:tabular-nums}.single-output-value input[type=number]{-moz-appearance:textfield}.single-output-value input[type=number]::-webkit-inner-spin-button,.single-output-value input[type=number]::-webkit-outer-spin-button{-webkit-appearance:none;margin:0}.single-output-value input.single-output-duration-input{padding-right:12px;text-align:center;font-family:ui-monospace,SFMono-Regular,Menlo,monospace;letter-spacing:.04em}.single-output-unit{position:absolute;right:12px;top:50%;transform:translateY(-50%);color:var(--eb-muted);font-size:12px;pointer-events:none}.single-output-help{display:block;margin-top:6px;color:var(--eb-muted);font-size:11px;line-height:1.45}.single-output-presets{display:flex;flex-wrap:wrap;gap:6px;margin-top:10px}.single-output-presets button{min-height:30px;padding:4px 9px;border-color:var(--eb-button-border);background:#fff;color:#526071;font-size:11px}.single-output-presets button:hover{background:var(--eb-button-soft-hover)}"
        ".single-output-estimate{margin:12px 0 0;padding:9px 11px;border:1px solid var(--eb-line-soft);border-radius:7px;background:#fff;color:var(--eb-muted);font-size:12px;line-height:1.5}.single-output-estimate.warn{border-color:#efd7b5;background:var(--eb-warn-soft);color:var(--eb-warn)}"
        ".single-output-note{margin:14px 0 0;color:var(--eb-muted);font-size:12px;line-height:1.55}.single-output-submit{display:flex;align-items:center;justify-content:space-between;gap:14px;margin-top:18px;padding-top:14px;border-top:1px solid var(--eb-line-soft)}.single-output-summary{color:var(--eb-muted);font-size:12px}.single-output-submit input{margin:0}"
        ".single-output-live{display:grid;grid-template-columns:repeat(4,minmax(0,1fr));gap:8px}.single-output-live>div{padding:11px;border-radius:8px;background:var(--eb-soft)}.single-output-live span,.single-output-live b{display:block}.single-output-live span{color:var(--eb-muted);font-size:11px}.single-output-live b{margin-top:3px;font-size:15px;font-weight:550}"
        ".single-output-progress{height:8px;margin-top:14px;border-radius:999px;background:var(--eb-soft);overflow:hidden}.single-output-progress>span{display:block;height:100%;width:0;background:var(--eb-primary);transition:width .3s}"
        "@media(max-width:900px){.single-output-workspace{grid-template-columns:1fr}.single-output-mode-group{max-width:420px}.single-output-editor{max-width:560px}}"
        "@media(max-width:760px){"
        ".zone-meter{align-items:stretch;flex-direction:column;gap:10px}.zone-meter .btnlink{width:100%}"
        ".single-output-zones,.single-output-live{grid-template-columns:repeat(2,minmax(0,1fr))}.single-output-submit{align-items:stretch;flex-direction:column}.single-output-submit input{width:100%}"
        "}"
        "@media(max-width:420px){"
        ".single-output-zones{grid-template-columns:1fr}.single-output-value-row{grid-template-columns:40px minmax(0,1fr) 40px}.single-output-stepper{width:40px;min-width:40px}"
        "}"
        "</style>");
    const IrrigationConfig* config = g_app->configuration();
    if (config) {
        char coefficient[20]{};
        IrrigationConfigRules::formatPulsesPerLiter(
            config->flowMeter.pulsesPerLiterX100, coefficient, sizeof(coefficient));
        Esp32BaseWeb::beginPanel("水路列表");
        Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='part zone-table'><thead><tr><th>水路</th><th>名称</th><th>启用状态</th><th>基准流量</th><th>操作</th></tr></thead><tbody>");
        for (const ZoneConfig& zone : config->zones) {
            char value[20]{};
            uint32_t flowMlPerMinute = 0;
            if (zone.baselinePulseRateX10000 != 0 &&
                FlowMonitor::pulseRateX10000ToFlowMlPerMinute(
                    zone.baselinePulseRateX10000,
                    config->flowMeter.pulsesPerLiterX100,
                    flowMlPerMinute)) {
                IrrigationConfigRules::formatLitersPerMinute(
                    flowMlPerMinute, value, sizeof(value));
            }
            Esp32BaseWeb::sendChunk("<tr><td>水路 "); sendUnsigned(zone.id);
            Esp32BaseWeb::sendChunk("</td><td>"); Esp32BaseWeb::writeHtmlEscaped(zone.name.data());
            Esp32BaseWeb::sendChunk("</td><td><span class='tag ");
            Esp32BaseWeb::sendChunk(zone.enabled ? "ok'>已启用" : "'>未启用");
            Esp32BaseWeb::sendChunk("</span></td><td>");
            if (zone.baselinePulseRateX10000 == 0) Esp32BaseWeb::sendChunk("<span class='muted'>未设置</span>");
            else if (value[0] == '\0') Esp32BaseWeb::sendChunk("<span class='muted'>超出显示范围</span>");
            else { Esp32BaseWeb::writeHtmlEscaped(value); Esp32BaseWeb::sendChunk(" L/min（已设置）"); }
            Esp32BaseWeb::sendChunk("</td><td><div class='fsactions'><button type='button' class='btnlink info compact' onclick=\"document.getElementById('zone-"); sendUnsigned(zone.id);
            Esp32BaseWeb::sendChunk("').showModal()\">修改</button>");
            Esp32BaseWeb::sendChunk("<a class='btnlink ok compact' href='/irrigation/zones/learning?zone="); sendUnsigned(zone.id); Esp32BaseWeb::sendChunk("'>"); Esp32BaseWeb::sendChunk(zone.enabled ? "学习基准流量" : "设置基准流量"); Esp32BaseWeb::sendChunk("</a>");
            Esp32BaseWeb::sendChunk("</div></td></tr>");
        }
        Esp32BaseWeb::sendChunk("</tbody></table></div>");
        Esp32BaseWeb::endPanel();
        Esp32BaseWeb::beginPanel("流量计维护");
        Esp32BaseWeb::sendChunk("<div class='zone-meter'><div class='zone-meter-main'><p class='zone-meter-label'>稳态流量系数</p><div class='zone-meter-value'><span class='zone-meter-number'>");
        Esp32BaseWeb::writeHtmlEscaped(coefficient);
        Esp32BaseWeb::sendChunk("</span><span class='zone-meter-unit'>P/L</span></div></div><a class='btnlink ok compact' href='/esp32base/app-config'>设置每升脉冲数</a></div>");
        Esp32BaseWeb::endPanel();
        const WateringStatus outputStatus = g_app->wateringStatus();
        Esp32BaseWeb::beginPanel("单次出水");
        if (outputStatus.active &&
            outputStatus.source == WateringSource::SingleOutput &&
            outputStatus.purpose == WateringPurpose::Normal) {
            const ZoneWateringSummary& zone = outputStatus.zones[outputStatus.currentStepIndex];
            Esp32BaseWeb::sendChunk("<p class='single-output-intro'>正在执行单次出水；保留无流量、流量异常和最长运行时间保护。</p><div id='single-output-live' class='single-output-live' data-target-water='");
            sendUnsigned(zone.targetWaterMl);
            Esp32BaseWeb::sendChunk("' data-target-time='"); sendUnsigned(zone.plannedDurationSec);
            Esp32BaseWeb::sendChunk("'><div><span>当前水路</span><b>");
            if (zone.zoneId >= 1 && zone.zoneId <= config->zones.size()) {
                Esp32BaseWeb::writeHtmlEscaped(config->zones[zone.zoneId - 1U].name.data());
            } else {
                Esp32BaseWeb::sendChunk("水路 "); sendUnsigned(zone.zoneId);
            }
            Esp32BaseWeb::sendChunk("</b></div><div><span>目标</span><b id='single-live-target'>—</b></div><div><span>实际出水</span><b id='single-live-time'>—</b></div><div><span>估算水量</span><b id='single-live-water'>—</b></div></div><div class='single-output-progress'><span id='single-live-progress'></span></div><div class='actions'><form method='post' action='/irrigation/zones' onsubmit=\"return confirm('确认停止当前单次出水？')&&once(this)\"><input type='hidden' name='action' value='stop_single_output'><input class='danger' type='submit' value='停止出水'></form></div><script>(function(){var live=document.getElementById('single-output-live'),bar=document.getElementById('single-live-progress');if(!live)return;function set(id,v){var e=document.getElementById(id);if(e)e.textContent=v}function duration(v){v=Math.max(0,Number(v)||0);if(v<60)return v+' 秒';return Math.floor(v/60)+' 分 '+v%60+' 秒'}function liters(v){return(Math.max(0,Number(v)||0)/1000).toFixed(1)+' L'}var targetWater=Number(live.dataset.targetWater)||0,targetTime=Number(live.dataset.targetTime)||0;set('single-live-target',targetWater?liters(targetWater):duration(targetTime));function poll(){fetch('/irrigation/api/status',{cache:'no-store',credentials:'same-origin'}).then(function(r){return r.json()}).then(function(s){if(!s.active||Number(s.source)!==1){location.reload();return}var z=s.zones&&s.zones[s.currentStepIndex]||{};set('single-live-time',duration(s.currentZoneElapsedSec));set('single-live-water',liters(z.estimatedWaterMl));var value=targetWater?Number(z.estimatedWaterMl):Number(s.currentZoneElapsedSec),target=targetWater||targetTime;if(bar)bar.style.width=(target?Math.min(100,Math.round(value*100/target)):0)+'%';setTimeout(poll,1000)}).catch(function(){setTimeout(poll,2000)})}poll()})();</script>");
        } else if (outputStatus.active) {
            Esp32BaseWeb::sendChunk("<p class='single-output-intro'>设备正在执行其他浇水或维护任务，结束后才能开始单次出水。</p><a class='btnlink secondary compact' href='/irrigation'>查看当前任务</a>");
        } else {
            bool hasEnabledZone = false;
            for (const ZoneConfig& zone : config->zones) {
                hasEnabledZone = hasEnabledZone || zone.enabled;
            }
            Esp32BaseWeb::sendChunk("<p class='single-output-intro'>用于临时取水或测试水路，一次只运行一条已启用水路，不会修改浇水计划。</p>");
            if (!hasEnabledZone) {
                Esp32BaseWeb::sendChunk("<div class='notice info'><b>还没有可用水路</b><p>请先在上方水路列表中启用实际安装的水路，然后再设置单次出水。</p></div>");
            } else {
                Esp32BaseWeb::sendChunk("<form id='single-output-form' method='post' action='/irrigation/zones' data-max-duration-seconds='");
                sendUnsigned(static_cast<uint32_t>(
                    config->runLimits.maximumZoneDurationMinutes) * 60U);
                Esp32BaseWeb::sendChunk("' data-max-volume-liters='");
                sendUnsigned(config->runLimits.maximumSingleOutputLiters);
                Esp32BaseWeb::sendChunk("' onsubmit='return submitSingleOutput(this)'><input type='hidden' name='action' value='start_single_output'><section class='single-output-step'><h3 class='single-output-step-title'><span>1</span>选择水路</h3><div class='single-output-zones'>");
                bool firstEnabledZone = true;
                for (const ZoneConfig& zone : config->zones) {
                    if (!zone.enabled) continue;
                    uint32_t baselineMlPerMinute = 0;
                    FlowMonitor::pulseRateX10000ToFlowMlPerMinute(
                        zone.baselinePulseRateX10000,
                        config->flowMeter.pulsesPerLiterX100,
                        baselineMlPerMinute);
                    Esp32BaseWeb::sendChunk("<label class='single-output-option'><input type='radio' name='zone_id' value='");
                    sendUnsigned(zone.id);
                    Esp32BaseWeb::sendChunk("' data-flow='");
                    sendUnsigned(baselineMlPerMinute);
                    Esp32BaseWeb::sendChunk("'");
                    if (firstEnabledZone) Esp32BaseWeb::sendChunk(" checked");
                    Esp32BaseWeb::sendChunk("><span class='single-output-zone-card'><span class='single-output-zone-check'>✓</span><b>");
                    Esp32BaseWeb::writeHtmlEscaped(zone.name.data());
                    Esp32BaseWeb::sendChunk("</b><small>水路 ");
                    sendUnsigned(zone.id);
                    if (baselineMlPerMinute != 0) {
                        Esp32BaseWeb::sendChunk(" · 基准 ");
                        char baseline[20]{};
                        IrrigationConfigRules::formatLitersPerMinute(
                            baselineMlPerMinute, baseline, sizeof(baseline));
                        Esp32BaseWeb::writeHtmlEscaped(baseline);
                        Esp32BaseWeb::sendChunk(" L/min");
                    }
                    Esp32BaseWeb::sendChunk("</small></span></label>");
                    firstEnabledZone = false;
                }
                IrrigationWebAssets::send(IrrigationWebAssets::Asset::SingleOutputForm);
            }
        }
        Esp32BaseWeb::endPanel();
        for (const ZoneConfig& zone : config->zones) {
            Esp32BaseWeb::sendChunk("<dialog id='zone-"); sendUnsigned(zone.id);
            Esp32BaseWeb::sendChunk("' class='panel eb-modal' data-eb-light-dismiss='1'><h2>修改水路 "); sendUnsigned(zone.id);
            Esp32BaseWeb::sendChunk("</h2><form method='post' action='/irrigation/zones' onsubmit='return once(this)'><input type='hidden' name='action' value='save'><input type='hidden' name='zone_id' value='"); sendUnsigned(zone.id);
            Esp32BaseWeb::sendChunk("'><input type='hidden' name='revision' value='"); sendUnsigned(config->revision);
            Esp32BaseWeb::sendChunk("'><div class='fieldgrid'><p class='field full'><label>水路名称</label><input name='name' maxlength='63' required value='"); Esp32BaseWeb::writeHtmlEscaped(zone.name.data());
