tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationWeb.cpp
        Esp32BaseWeb::sendChunk(";if(!input||!output)return;function update(){var flow=Number(input.value),rateX10000=Math.round(flow*1000*coefficientX100/600);output.textContent=Number.isFinite(flow)&&flow>0&&rateX10000>0?(rateX10000/10000).toFixed(4)+' P/s':(flow>0?'低于可保存范围':'—')}input.addEventListener('input',update);update()})();</script>");
    }
    Esp32BaseWeb::sendChunk("<p><a class='btnlink secondary' href='/irrigation/zones'>返回水路设置</a></p>");
    if (active) {
        IrrigationWebAssets::send(IrrigationWebAssets::Asset::LearningScript);
    }
    endPage();
}

void IrrigationWeb::records() {
    if (!beginPage("浇水记录", "最新记录优先")) return;
    Esp32BaseWeb::sendChunk("<p><a class='btnlink secondary' href='/irrigation/events'>操作事件与当前异常</a></p>");
    IrrigationWebAssets::send(IrrigationWebAssets::Asset::RecordsStyle);
    uint32_t detailId = 0;
    char idText[16]{};
    const bool detailRequested = getParam("id", idText, sizeof(idText)) &&
                                 parseUint(idText, 1, UINT32_MAX, detailId);
    uint32_t page = 1, perPage = 15;
    char text[16]{};
    if (getParam("page", text, sizeof(text))) parseUint(text, 1, UINT32_MAX, page);
    if (getParam("per", text, sizeof(text))) parseUint(text, 10, 50, perPage);
    Esp32BaseRecordStore::StoreStatus status{};
    const bool statusReady = g_app->readWateringRecordStoreStatus(status);
    if (statusReady && status.recordCount != 0) {
        const uint32_t totalPages = (status.recordCount + perPage - 1U) / perPage;
        if (page > totalPages) page = totalPages;
    } else {
        page = 1;
    }
    Esp32BaseWeb::beginPanel("历史记录");
    Esp32BaseWeb::sendChunk("<div class='record-toolbar'><p>");
    if (statusReady) {
        Esp32BaseWeb::sendChunk("设备当前保存 ");
        sendUnsigned(status.recordCount);
        Esp32BaseWeb::sendChunk(" 条记录");
    } else {
        Esp32BaseWeb::sendChunk("记录存储状态不可用");
    }
    Esp32BaseWeb::sendChunk("</p></div>");
    if (!statusReady) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER,
                                 "浇水记录暂时无法读取",
                                 "请在系统状态中检查业务记录存储。");
    } else {
        Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='record-table'><thead><tr><th>完成时间</th><th>浇水任务</th><th>执行水路</th><th>执行结果</th><th>实际 / 目标</th><th>估算用水量</th><th>操作</th></tr></thead><tbody>");
        RecordRowsContext context{g_app->configuration(), 0};
        bool readOk = true;
        if (status.recordCount == 0) {
            Esp32BaseWeb::sendChunk("<tr class='record-empty-row'><td class='record-empty-cell' colspan='7'><b>还没有浇水记录</b><span>第一次浇水执行结束后，无论完成、停止或失败，记录都会显示在这里。</span></td></tr>");
        } else {
            readOk = g_app->readLatestWateringRecords(
                (page - 1U) * perPage, perPage, sendRecordRow, &context);
        }
        Esp32BaseWeb::sendChunk("</tbody></table></div>");
        if (!readOk) {
            Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER,
                                     "本页记录读取失败",
                                     "请刷新页面；如果问题持续，请检查记录存储状态。");
        } else if (status.recordCount != 0 && context.emitted == 0) {
            Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_INFO,
                                     "本页没有记录",
                                     "页码已经调整，请刷新后重试。");
        }
        if (status.recordCount != 0) {
            Esp32BaseWeb::Pagination pagination{};
            pagination.path = "/irrigation/records";
            pagination.query = "";
            pagination.page = page;
            pagination.perPage = perPage;
            pagination.total = status.recordCount;
            Esp32BaseWeb::sendPagination(pagination);
        }
    }
    Esp32BaseWeb::endPanel();
    if (detailRequested) {
        StoredWateringRecord detail{};
        if (g_app->readWateringRecordById(detailId, detail) ==
            Esp32BaseRecordStore::RecordReadResult::Found) {
            sendRecordDetailDialog(detail, g_app->configuration(), "record-direct-detail-");
            Esp32BaseWeb::sendChunk("<script>(function(){var d=document.getElementById('record-direct-detail-");
            sendUnsigned(detailId);
            Esp32BaseWeb::sendChunk("');if(d&&d.showModal)d.showModal();})();</script>");
        } else {
            Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER,
                                     "找不到该浇水记录",
                                     "记录可能已经轮换或被清空。");
        }
    }
    endPage();
}

void IrrigationWeb::events() {
    if (!beginPage("事件", "查看操作记录与当前异常")) return;
    Esp32BaseWeb::sendChunk("<p><a href='/irrigation/records'>返回浇水记录</a></p>");
    IrrigationWebAssets::send(IrrigationWebAssets::Asset::EventsStyle);

    EventFilter filter{};
    char value[20]{};
    if (getParam("level", value, sizeof(value))) {
        if (std::strcmp(value, "info") == 0) filter.level = static_cast<uint8_t>(IrrigationEvents::Level::Info);
        else if (std::strcmp(value, "warning") == 0) filter.level = static_cast<uint8_t>(IrrigationEvents::Level::Warning);
        else if (std::strcmp(value, "error") == 0) filter.level = static_cast<uint8_t>(IrrigationEvents::Level::Error);
    }
    if (getParam("category", value, sizeof(value))) {
        if (std::strcmp(value, "watering") == 0) filter.category = static_cast<int8_t>(IrrigationEvents::Category::WateringAndFlow);
        else if (std::strcmp(value, "automatic") == 0) filter.category = static_cast<int8_t>(IrrigationEvents::Category::AutomaticWatering);
        else if (std::strcmp(value, "settings") == 0) filter.category = static_cast<int8_t>(IrrigationEvents::Category::Settings);
        else if (std::strcmp(value, "time") == 0) filter.category = static_cast<int8_t>(IrrigationEvents::Category::TimeAndStorage);
    }
    const char* levelQuery = filter.level == static_cast<uint8_t>(IrrigationEvents::Level::Info) ? "info" :
                             filter.level == static_cast<uint8_t>(IrrigationEvents::Level::Warning) ? "warning" :
                             filter.level == static_cast<uint8_t>(IrrigationEvents::Level::Error) ? "error" : "";
    const char* categoryQuery = filter.category == static_cast<int8_t>(IrrigationEvents::Category::WateringAndFlow) ? "watering" :
                                filter.category == static_cast<int8_t>(IrrigationEvents::Category::AutomaticWatering) ? "automatic" :
                                filter.category == static_cast<int8_t>(IrrigationEvents::Category::Settings) ? "settings" :
                                filter.category == static_cast<int8_t>(IrrigationEvents::Category::TimeAndStorage) ? "time" : "";
    if (levelQuery[0] && categoryQuery[0]) std::snprintf(filter.query, sizeof(filter.query), "level=%s&category=%s", levelQuery, categoryQuery);
    else if (levelQuery[0]) std::snprintf(filter.query, sizeof(filter.query), "level=%s", levelQuery);
    else if (categoryQuery[0]) std::snprintf(filter.query, sizeof(filter.query), "category=%s", categoryQuery);

    uint32_t page = 1;
    if (getParam("page", value, sizeof(value))) parseUint(value, 1, UINT32_MAX, page);
    IrrigationEvents::EventStatus status{};
    const bool statusReady = g_app->readEventStatus(status) && status.eventStore.ready;
    if (!statusReady) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER,
                                 "事件暂时无法读取",
                                 "请在系统状态中检查事件存储。");
        endPage();
        return;
    }
    if (!status.conditionStateLoaded || status.conditionStateSavePending) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER,
                                 "事件状态保存异常",
                                 "持续问题仍会显示当前状态，但新的发生或恢复可能无法保存。");
    }

    struct ConditionCard {
        uint8_t id;
        const char* name;
        const char* description;
    };
    static constexpr ConditionCard conditions[] = {
        {1, "硬件时钟", "影响断网后的可靠计时"},
        {2, "设备时间", "影响自动计划按时执行"},
        {3, "时间倒退保护", "异常时暂停自动计划"},
        {4, "关阀后水流", "监测阀门关闭后的异常水流"},
    };
    IrrigationEvents::ConditionDisplayState conditionStates[
        sizeof(conditions) / sizeof(conditions[0])]{};
    uint8_t activeConditionCount = 0;
    for (std::size_t index = 0;
         index < sizeof(conditions) / sizeof(conditions[0]);
         ++index) {
        conditionStates[index] =
            g_app->eventConditionState(conditions[index].id);
        if (conditionStates[index] ==
                IrrigationEvents::ConditionDisplayState::Active ||
            conditionStates[index] ==
                IrrigationEvents::ConditionDisplayState::ConfirmingRecovery) {
            ++activeConditionCount;
        }
    }
    Esp32BaseWeb::beginPanel("当前持续状态");
    Esp32BaseWeb::sendChunk("<div class='condition-summary'><p>共监测 4 项；当前持续异常 ");
    sendUnsigned(activeConditionCount);
    Esp32BaseWeb::sendChunk(" 项</p><small>等待判断不计入异常；需要确认的状态会明确标出</small></div><div class='condition-grid'>");
    for (std::size_t index = 0;
         index < sizeof(conditions) / sizeof(conditions[0]);
         ++index) {
        const ConditionCard& condition = conditions[index];
        const IrrigationEvents::ConditionDisplayState state =
            conditionStates[index];
        Esp32BaseWeb::sendChunk("<div class='condition-item'><div><b>");
        Esp32BaseWeb::sendChunk(condition.name);
        Esp32BaseWeb::sendChunk("</b><small>");
        if (condition.id != 4) {
            Esp32BaseWeb::sendChunk(condition.description);
        } else if (g_app->wateringActive()) {
            Esp32BaseWeb::sendChunk("浇水期间暂停，结束后重新观察");
        } else if (g_app->unexpectedFlowObservationReady()) {
            Esp32BaseWeb::sendChunk("最近完整窗口已完成判断");
        } else if (g_app->unexpectedFlowDelayRemainingSec() != 0) {
            Esp32BaseWeb::sendChunk("等待余流消退，约剩 ");
            sendUnsigned(g_app->unexpectedFlowDelayRemainingSec());
            Esp32BaseWeb::sendChunk(" 秒");
        } else {
            Esp32BaseWeb::sendChunk("正在收集首个完整窗口，约剩 ");
            sendUnsigned(g_app->unexpectedFlowWindowRemainingSec());
            Esp32BaseWeb::sendChunk(" 秒");
        }
        Esp32BaseWeb::sendChunk("</small></div><span class='tag ");
        Esp32BaseWeb::sendChunk(conditionStateTone(state));
        Esp32BaseWeb::sendChunk("'>");
        Esp32BaseWeb::sendChunk(conditionStateName(state));
        Esp32BaseWeb::sendChunk("</span></div>");
    }
    Esp32BaseWeb::sendChunk("</div>");
    Esp32BaseWeb::endPanel();

